'use strict';
(function () {
  window.data = {
    COMMENTS_MESSAGES: [
      'Всё отлично!',
      'В целом всё неплохо. Но не всё.',
      'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
      'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
      'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
      'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
    ],
    COMMENTS_NAMES: ['Иван', 'Хуан Себастьян', 'Мария', 'Кристоф', 'Виктор', 'Юлия', 'Люпита', 'Вашингтон'],
    NUMBER_PHOTO: 25,
    MIN_PHOTO_URL: 1,
    MAX_PHOTO_URL: 25,
    MIN_AVATAR_URL: 1,
    MAX_AVATAR_URL: 6,
    MIN_LIKES: 15,
    MAX_LIKES: 200,
    MIN_COMMENTS: 0,
    MAX_COMMENTS: 20
  };

})();
